
{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.6.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 224, 224, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "vgg16_input"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "block1_conv1",
              "trainable": false,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}}
            }
          },
          {
            "class_name": "MaxPooling2D",
            "config": {
              "name": "block1_pool",
              "trainable": false,
              "dtype": "float32",
              "pool_size": [2, 2],
              "padding": "valid",
              "strides": [2, 2],
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Flatten",
            "config": {
              "name": "flatten",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 512,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}}
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.5,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 3,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {"seed": null}
              },
              "bias_initializer": {"class_name": "Zeros", "config": {}}
            }
          }
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["weights.bin"],
      "weights": []
    }
  ]
}
